<script setup>
import AuthenticatedLayout from "@/Layouts/AuthenticatedLayout.vue";
import { Head } from "@inertiajs/vue3";
import TitleImage from "@/Components/TitleImage.vue";
import Dropdown from "@/Components/Dropdown.vue";

function selectDate() {}
</script>

<template>
    <Head title="О компании" />

    <AuthenticatedLayout>
        <div class="py-12">
            <div class="max-w-9xl mx-auto sm:px-4 lg:px-6">
                <div class="overflow-hidden shadow-sm sm:rounded-lg">
                    <div
                        class="p-2 flex flex-col gap-14 md:gap-28 text-gray-900 dark:text-gray-100"
                    >
                        <div class="grid grid-row-auto gap-24">
                            <TitleImage
                                text="Для тех, кто со мной ещё не знаком. Меня зовут Елена Городова.
Я адвокат с 1999 года, состою в Центральной Свердловской Адвокатской конторе г. Белгорода.
Адвокатом мечтала быть ещё в школе. Считаю, что адвокатура — мое призвание, я занимаюсь любимым делом. В начале адвокатской деятельности искала себя во всех отраслях права. Со временем определилась со специализацией. Сейчас это уголовные дела, гражданские дела, семейные и наследственные споры, юридическое обслуживание среднего и малого бизнеса. Я нацелена на достижение максимального результата в защите прав и интересов своих клиентов!"
                                img="09"
                            />
                        </div>
                        <div class="flex flex-col gap-12"></div>
                        <TitleImage
                            text="Для тех, кто со мной ещё не знаком,
                        позвольте быстро представиться. Меня зовут Лариса
                        Городова. Я адвокат с 1999 года. Получила два высших
                        образования, в Воронежском государственном университете,
                        классическое юридическое и международно-правовое в
                        ВАВТе, город Москва. Адвокатом мечтала быть ещё в школе.
                        Считаю, что мне повезло - я занимаюсь любимым делом. В
                        начале адвокатской деятельности искала себя во всех
                        направлениях, включая уголовные дела. Со временем
                        определилась со специализацией. Сейчас это арбитраж,
                        международный арбитраж и юридическое обслуживание
                        среднего и малого бизнеса. Оказываю услуги и физическим
                        лицам в области наследственного и жилищного права."
                            img="larisa"
                            :reverse="true"
                        />
                        <div
                            class="mt-16 text-xl sm:text-3xl md:text-4xl lg:text-5xl text-currentBroun w-full text-center"
                        >
                            <h2>Наши преймущества</h2>
                        </div>
                        <div
                            class="mb-32 mx-auto w-11/12 grid grid-cols-1 gap-8"
                        >
                            <div
                                v-for="item in items"
                                :key="item"
                                class="flex mb-4"
                                @click="alerting($event, item.number)"
                            >
                                <div
                                    class="text-sm border-b-2 border-l-2 border-currentBroun rounded-lg w-full grid"
                                >
                                    <div
                                        class="font-semibold text-base sm:text-2xl flex justify-between pr-8 pl-2"
                                    >
                                        <h3>{{ item.title }}</h3>
                                        <h2 class="text-md text-currentLight">
                                            {{ "0" + item.number }}
                                        </h2>
                                    </div>
                                    <div
                                        class="overflow-hidden sm:text-lg pl-2"
                                    >
                                        <p
                                            :id="'His' + item.number"
                                            class="unActive pt-4 h-auto duration-700 md:w-1/2"
                                        >
                                            {{ item.message }}
                                        </p>
                                    </div>
                                </div>
                                <span class="inline-flex rounded-sm">
                                    <button
                                        type="button"
                                        class="inline-flex items-start px-3 py-2 border border-transparent text-sm leading-4 font-medium rounded-sm text-gray-500 dark:text-gray-400 hover:text-gray-700 dark:hover:text-gray-300 focus:outline-none transition ease-in-out duration-150"
                                    >
                                        <span class="material-symbols-outlined">
                                            add
                                        </span>
                                    </button>
                                </span>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </AuthenticatedLayout>
</template>

<script>
export default {
    data() {
        return {
            isActive: {
                type: String,
                default: false,
            },
            items: [
                {
                    number: "1",
                    title: "Абонентское обслуживание ",
                    message:
                        "Устное и письменное консультирование по вопросам, возникающим в процессе финансово-хозяйственной деятельности компании; Подготовка экспертных заключений по правовым вопросам; Разработка и правовой анализ различных видов договоров, соглашений и иных документов;Правовое обеспечение трудовых отношений; Участие в переговорах с контрагентами и представление интересов компании при взаимодействии с государственными органами; Обеспечение претензионной деятельности; Правовое обеспечение хозяйственных сделок; Участие и документальное оформление корпоративных процедур; При необходимости, консультирование руководства и сотрудников компании по семейному, жилищному и наследственному праву.",
                },
                {
                    number: "2",
                    title: "Международное право",
                    message:
                        "Международный коммерческий арбитраж; Оспаривание, признание и приведение в исполнение решений международных коммерческих арбитражей и решений иностранных судов; Участие в переговорах по делам в сфере внешнеэкономических сделок; Содействие в заключении мировых соглашений и их реализаций; Консультации и подготовка соглашений, осложненных иностранным элементом с определением арбитражной оговорки; Подготовка меморандумов по фактам для иностранных консультантов; Подготовка юридических заключений и справок по российскому праву;",
                },
                {
                    number: "3",
                    title: "Арбитражные споры",
                    message:
                        "Анализ ситуации и оценка перспективы дела в офисе адвоката либо в офисе клиента; Разработка стратегии дела и позиции клиента с учетом возможных рисков; Сбор доказательной базы всеми доступными правовыми методами , в том числе с помощью адвокатских запросов; Проведение переговоров с контрагентом с целью досудебного урегулирования спора; Личное представительство клиента на всех стадиях судебного процесса; Правовое сопровождение исполнительного производства.",
                },
                {
                    number: "4",
                    title: "Жилищное право",
                    message:
                        " Признание утратившим право пользования жилым помещением; Снятие с регистрационного учета; Восстановление на жилищном учете; Изменение договора социального найма; Заключение договора социального найма; Определение порядка пользования жилым помещение; Вселение и нечинение препятствий в пользовании жилым помещением; Признание права собственности; Признание сделки недействительной (договора купли-продажи, ренты, дарения).",
                },
                {
                    number: "5",
                    title: "Наследственне право",
                    message:
                        "Правовая помощь в международных наследственных делах; Признание завещания недействительным; Выделение доли супругов; Признание обязательной доли наследства; Признание права собственности на имущество в порядке наследования; Установление факта родственных отношений; Восстановление срока для принятия наследства; Установление факта принятия наследства;",
                },
            ],
        };
    },
    methods: {
        alerting(ev, item) {
            const app = document.getElementById("His" + item);

            app.classList.contains("active")
                ? (app.classList.remove("active"),
                  app.classList.add("unActive"))
                : (app.classList.remove("unActive"),
                  app.classList.add("active"));
        },
    },
    components: {
        TitleImage,
    },
};
</script>

<style>
.unActive {
    margin-top: -600px;
}

.active {
    margin-top: 0;
}
</style>
